<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    */

    'required' => ':attributeを入力してください',
    'email'    => ':attributeの形式が正しくありません',
    'password' => 'パスワードが正しくありません',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    */

    'custom' => [
        // Fortifyのログイン失敗用（authenticateUsingで使う）
        'email' => [
            'exists' => 'ログイン情報が登録されていません',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    | :attribute を日本語に置き換える
    */

    'attributes' => [
        'email'    => 'メールアドレス',
        'password' => 'パスワード',
    ],

];
